config/cf/Catalogs/ПериодыПервичныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ПериодыПервичныхДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидПериодаПервичногоДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыПервичныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Enums/ВидПериодаПервичногоДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидПериодаПервичногоДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разовый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Catalogs/ПериодыПервичныхДокументов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
				
		ТекущаяДата				= ТекущаяДатаСеанса();
		Объект.ВидПериода		= Перечисления.ВидПериодаПервичногоДокумента.Месяц;
		Объект.Год				= Год(ТекущаяДата);		
		Объект.ЗначениеПериода	= Перечисления.ПериодыПервичныхДокументов[Месяц(ТекущаяДата) - 1];
		
		АвтоНаименование();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ВидПериода) Тогда
		
		Объект.ЗначениеПериода = 
				ПредопределенноеЗначение("Перечисление.ПериодыПервичныхДокументов.ПустаяСсылка");

		Если Объект.ВидПериода = 
			ПредопределенноеЗначение("Перечисление.ВидПериодаПервичногоДокумента.Год") Тогда
			
			Объект.ЗначениеПериода = 
				ПредопределенноеЗначение("Перечисление.ПериодыПервичныхДокументов.ПустаяСсылка");
				
			Элементы.ЗначениеПериода.Видимость = Ложь;
			
		ИначеЕсли Объект.ВидПериода = 
			ПредопределенноеЗначение("Перечисление.ВидПериодаПервичногоДокумента.Разовый") Тогда
			
			Объект.ЗначениеПериода = 
				ПредопределенноеЗначение("Перечисление.ПериодыПервичныхДокументов.ПустаяСсылка");
				
			Объект.Год = 0;	
			Элементы.ЗначениеПериода.Видимость	= Ложь;	
			Элементы.Год.Видимость 				= Ложь;	
			
		Иначе
			Элементы.ЗначениеПериода.Видимость = Истина;
			
		КонецЕсли;	
	КонецЕсли;	
	
	АвтоНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПериодаПриИзменении(Элемент)
	
	АвтоНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	
	АвтоНаименование();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПериодаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияПериода();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗначенияПериода()
	
	Элементы.ЗначениеПериода.СписокВыбора.Очистить();
	
	Если Объект.ВидПериода = Перечисления.ВидПериодаПервичногоДокумента.Год Тогда
		Элементы.ЗначениеПериода.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ЗначениеПериода.Видимость = Истина;
	
	мПараметрыВыбора= Новый Структура;	
	мОтбор			= Новый Структура;	
	мОтбор.Вставить("ВидПериода", Объект.ВидПериода); 
	мПараметрыВыбора.Вставить("Отбор", мОтбор);
	мПараметрыВыбора.Вставить("СтрокаПоиска", "");
	
	ЗначенияПериода = Перечисления.ПериодыПервичныхДокументов.ПолучитьДанныеВыбора(мПараметрыВыбора);
	Элементы.ЗначениеПериода.СписокВыбора.ЗагрузитьЗначения(ЗначенияПериода.ВыгрузитьЗначения());
	
КонецПроцедуры	

&НаСервере
Процедура АвтоНаименование()
	
	Объект.Наименование = ПервичныеДокументыСервер.АвтонаименованиеПериода(Объект);	
	Модифицированность = Истина;
	
КонецПроцедуры	

#КонецОбласти
